In [1]:
import pandas as pd

data = {
    "Name": ["Ram", "Sita", "Hari", "Gita"],
    "Age": [22, 19, 25, 21],
    "Marks": [78, 85, 67, 90]
}

df = pd.DataFrame(data)
df

   Name  Age  Marks
0   Ram   22     78
1  Sita   19     85
2  Hari   25     67
3  Gita   21     90

In [2]:
#Sort by Age
df.sort_values(by="Age")

   Name  Age  Marks
1  Sita   19     85
3  Gita   21     90
0   Ram   22     78
2  Hari   25     67

In [3]:
# Sort by Marks (descending)
df.sort_values(by="Marks", ascending=False)

   Name  Age  Marks
3  Gita   21     90
1  Sita   19     85
0   Ram   22     78
2  Hari   25     67

In [4]:
# First by Age, then by Marks
df.sort_values(by=["Age", "Marks"])

   Name  Age  Marks
1  Sita   19     85
3  Gita   21     90
0   Ram   22     78
2  Hari   25     67

In [5]:
df.sort_values(by=["Age", "Marks"], ascending=[True, False])
# Different order for each column:

   Name  Age  Marks
1  Sita   19     85
3  Gita   21     90
0   Ram   22     78
2  Hari   25     67

In [6]:
df.sort_index()
# sort by index

   Name  Age  Marks
0   Ram   22     78
1  Sita   19     85
2  Hari   25     67
3  Gita   21     90

In [ ]:
df.sort_index(ascending=False)

In [ ]:
# Sort and save changes (inplace)
df.sort_values(by="Marks", inplace=True)

In [7]:
# Sort strings (alphabetical order)
df.sort_values(by="Name")

   Name  Age  Marks
3  Gita   21     90
2  Hari   25     67
0   Ram   22     78
1  Sita   19     85

In [8]:
# Reverse alphabetical:
df.sort_values(by="Name", ascending=False)

   Name  Age  Marks
1  Sita   19     85
0   Ram   22     78
2  Hari   25     67
3  Gita   21     90

## ðŸ§  Quick Summary

| Task | Method |
|------|--------|
| Sort rows | `sort_values()` |
| Sort index | `sort_index()` |
| Descending order | `ascending=False` |
| Multiple columns | `by=[...]` |
| Save changes | `inplace=True` |
| Fix index | `reset_index(drop=True)` |